package com.MarineTrafficClone.SeaWatch.enumeration;

/**
 * Enumeration που ορίζει τους διαθέσιμους τύπους περιορισμών (constraints)
 * που μπορούν να εφαρμοστούν σε μια ζώνη ενδιαφέροντος (Zone of Interest).
 */
public enum ZoneConstraintType {
    /** Ειδοποίηση αν η ταχύτητα του πλοίου υπερβεί μια τιμή. */
    SPEED_LIMIT_ABOVE,

    /** Ειδοποίηση αν η ταχύτητα του πλοίου πέσει κάτω από μια τιμή. */
    SPEED_LIMIT_BELOW,

    /** Ειδοποίηση όταν ένα πλοίο εισέρχεται στη ζώνη. */
    ZONE_ENTRY,

    /** Ειδοποίηση όταν ένα πλοίο που ήταν μέσα στη ζώνη, εξέρχεται από αυτήν. */
    ZONE_EXIT,

    /** Ειδοποίηση αν ένας συγκεκριμένος (απαγορευμένος) τύπος πλοίου βρίσκεται μέσα στη ζώνη. */
    FORBIDDEN_SHIP_TYPE,

    /** Ειδοποίηση αν ένα πλοίο έχει μια συγκεκριμένη (ανεπιθύμητη) ναυτιλιακή κατάσταση (navigational status). */
    UNWANTED_NAV_STATUS
}